简历

熟悉Android4.x时代SDK以及Android各版本适配；

精通JAVA语言，熟悉XML、Linux、TCP/IP和HTTP协议；

Android系统开发相关经验优先；

具备快速学习新技术的能力，有良好的英语读写能力，沟通零距离；

工作责任心强，积极主动，思路清晰有条理，有良好的团队协作精神.

 精通Android 四大组件，并在项目中有实际的应用；
 
 精通Android SDK，可以熟练使用各种布局快速构建UI;
 
 精通Android 网络编程，熟悉HTTP协议，能够熟练使用异步，多线程技术；
 
 精通多线程和网络编程，对高性能，高稳定性程序设计、架构有较多经验
 
 具备良好编程习惯，有大规模代码的阅读和修改经验者优先。
 
 有OpenGL开发经验优先。
 
 熟悉网络应用开发，具备J2EE或PHP等相关网络开发经验; 熟悉JavaScript、CSS、AJAX等技术
 
 对内存使用和性能优化有持续追求；
 
 深入了解android平台内存管理机制、进程管理机制、任务管理机制；
 
 深入了解UI事件传递、布局、绘制等原理；
 
 熟悉TCP/IP，HTTP，HTTPS等网络协议
 
 良好的数据结构和算法基础，良好的编码习惯
 
 对手机软件性能优化、内存优化有一定经验；